In [1]:
import numpy as np 
import pandas as pd

In [ ]:
# Finding Missing value

In [14]:
data = {
    'A' : [1,2,np.nan,4,5],
    'B' : [1,3,4,5,2],
    'C' : [1,2,3,np.nan,np.nan],
    'D' : [1,np.nan,np.nan,np.nan,5]
}
df = pd.DataFrame(data)

In [15]:
df

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  3  2.0  NaN
2  NaN  4  3.0  NaN
3  4.0  5  NaN  NaN
4  5.0  2  NaN  5.0

In [16]:
df.isna()

       A      B      C      D
0  False  False  False  False
1  False  False  False   True
2   True  False  False   True
3  False  False   True   True
4  False  False   True  False

In [17]:
df.isna().sum()

A    1
B    0
C    2
D    3
dtype: int64

In [18]:
df.isna().any()

A     True
B    False
C     True
D     True
dtype: bool

In [21]:
# Removing missing Data

In [19]:
df

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  3  2.0  NaN
2  NaN  4  3.0  NaN
3  4.0  5  NaN  NaN
4  5.0  2  NaN  5.0

In [20]:
df.dropna()

     A  B    C    D
0  1.0  1  1.0  1.0

In [23]:
df.dropna(thresh = 1)

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  3  2.0  NaN
2  NaN  4  3.0  NaN
3  4.0  5  NaN  NaN
4  5.0  2  NaN  5.0

In [24]:
# Filling the Missing Data

In [25]:
df

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  3  2.0  NaN
2  NaN  4  3.0  NaN
3  4.0  5  NaN  NaN
4  5.0  2  NaN  5.0

In [27]:
df.fillna(0)

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  3  2.0  0.0
2  0.0  4  3.0  0.0
3  4.0  5  0.0  0.0
4  5.0  2  0.0  5.0

In [31]:
values = {'A':0, 'B':100, 'C':200, 'D':500}
df.fillna(value= values)

     A  B      C      D
0  1.0  1    1.0    1.0
1  2.0  3    2.0  500.0
2  0.0  4    3.0  500.0
3  4.0  5  200.0  500.0
4  5.0  2  200.0    5.0

In [32]:
df.fillna(df.mean())

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  3  2.0  3.0
2  3.0  4  3.0  3.0
3  4.0  5  2.0  3.0
4  5.0  2  2.0  5.0